winbond-secure-flash/w77x-compat-suite/platform/NXP685_setup/nxp_rt685_bsp/board/pin_mux.c
    const uint32_t FLEXSPIOA_DATA0 = (/* Pin is configured as FLEXSPI0A_DATA0 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN20 (coords: T5) is configured as FLEXSPI0A_DATA0 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA0_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA0_PIN, FLEXSPIOA_DATA0);

    const uint32_t FLEXSPIOA_DATA1 = (/* Pin is configured as FLEXSPI0A_DATA1 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN21 (coords: U5) is configured as FLEXSPI0A_DATA1 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA1_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA1_PIN, FLEXSPIOA_DATA1);

    const uint32_t FLEXSPIOA_DATA2 = (/* Pin is configured as FLEXSPI0A_DATA2 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN22 (coords: P6) is configured as FLEXSPI0A_DATA2 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA2_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA2_PIN, FLEXSPIOA_DATA2);

    const uint32_t FLEXSPIOA_DATA3 = (/* Pin is configured as FLEXSPI0A_DATA3 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN23 (coords: P7) is configured as FLEXSPI0A_DATA3 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA3_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA3_PIN, FLEXSPIOA_DATA3);

    const uint32_t FLEXSPIOA_DATA4 = (/* Pin is configured as FLEXSPI0A_DATA4 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN24 (coords: T7) is configured as FLEXSPI0A_DATA4 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA4_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA4_PIN, FLEXSPIOA_DATA4);

    const uint32_t FLEXSPIOA_DATA5 = (/* Pin is configured as FLEXSPI0A_DATA5 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN25 (coords: U7) is configured as FLEXSPI0A_DATA5 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA5_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA5_PIN, FLEXSPIOA_DATA5);

    const uint32_t FLEXSPIOA_DATA6 = (/* Pin is configured as FLEXSPI0A_DATA6 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN26 (coords: R7) is configured as FLEXSPI0A_DATA6 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA6_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA6_PIN, FLEXSPIOA_DATA6);

    const uint32_t FLEXSPIOA_DATA7 = (/* Pin is configured as FLEXSPI0A_DATA7 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Enables input buffer function */
                                      IOPCTL_PIO_INBUF_EN |
                                      /* Normal mode */
                                      IOPCTL_PIO_SLEW_RATE_NORMAL |
                                      /* Normal drive */
                                      IOPCTL_PIO_FULLDRIVE_DI |
                                      /* Analog mux is disabled */
                                      IOPCTL_PIO_ANAMUX_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI);
    /* PORT1 PIN27 (coords: T8) is configured as FLEXSPI0A_DATA7 */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA7_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DATA7_PIN, FLEXSPIOA_DATA7);

    const uint32_t FLEXSPIOA_DQS = (/* Pin is configured as FLEXSPI0A_DQS */
                                    IOPCTL_PIO_FUNC1 |
                                    /* Enable pull-up / pull-down function */
                                    IOPCTL_PIO_PUPD_EN |
                                    /* Enable pull-up function */
                                    IOPCTL_PIO_PULLUP_EN |
                                    /* Enables input buffer function */
                                    IOPCTL_PIO_INBUF_EN |
                                    /* Normal mode */
                                    IOPCTL_PIO_SLEW_RATE_NORMAL |
                                    /* Normal drive */
                                    IOPCTL_PIO_FULLDRIVE_DI |
                                    /* Analog mux is disabled */
                                    IOPCTL_PIO_ANAMUX_DI |
                                    /* Pseudo Output Drain is disabled */
                                    IOPCTL_PIO_PSEDRAIN_DI |
                                    /* Input function is not inverted */
                                    IOPCTL_PIO_INV_DI);
    /* PORT1 PIN28 (coords: U9) is configured as FLEXSPI0A_DQS */
    IOPCTL_PinMuxSet(IOPCTL, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DQS_PORT, BOARD_INITFLEXSPI0APINS_FLEXSPIOA_DQS_PIN, FLEXSPIOA_DQS);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
